{
  "jobs": [
    {
      "company": "Peak Scientific",
      "description": "First line of support for all IT related issues.",
      "duration": "Apr 2024 - Present",
      "location": "Westford, MA",
      "logo": "./assets/Peak.png",
      "title": "IT Service Delivery Specialist",
      "tools": ["Intune", "Sophos AV", "Zendesk"]
    },
    {
      "company": "Foundation Medicine",
      "description": "As a key member of the IT support team, I provide first-line assistance for IT services to both employees and the lab, ensuring that all issues are addressed promptly and effectively. My responsibilities include documenting ticket resolutions and escalations, as well as assisting the Service Desk and IT Teams team during major incidents to maintain operational efficiency. I created and supported user accounts, configure laptops, and set up email, printers, and software on end-user devices. Additionally, I provide technical support for audio, visual, and network issues, conduct remote maintenance, and participate in office setups. My commitment to high customer satisfaction is evident through both online and in-person support, where I strive to exceed user expectations.",
      "duration": "Oct 2023 - Feb 2024",
      "location": "Cambridge, MA",
      "logo": "./assets/Foundation_medicine_logo.svg.png",
      "title": "Service Desk Tech II",
      "tools": ["Confluence", "Duo", "Okta", "SCCM", "ServiceNow", "Smartsheet"]
    },
    {
      "company": "PSM @ IHI",
      "description": "The role involves the consistent review and assignment of issues submitted to the ConnectWise Service Boards via email, phone calls, or alerts generated from monitoring systems. Additionally, it encompasses providing Level 1 system administration support for essential IT systems, including Active Directory, Office 365, Microsoft Azure, Microsoft Defender, and Microsoft Intune.",
      "duration": "Jun 2023 - Oct 2023",
      "location": "Boston, MA",
      "logo": "./assets/IHI-logo.png",
      "title": "Service Desk Engineer",
      "tools": ["Active Directory", "ConnectWise", "Microsoft 365", "Microsoft Azure", "Microsoft Defender", "Microsoft Intune"]
    },
    {
      "company": "Ventus Therapeutics",
      "description": "In my role at the Waltham office, I successfully managed the IT inventory and lab equipment, ensuring all resources were utilized efficiently. I played a key role in co-managing our Microsoft 365 tenant alongside our Managed Service Provider, streamlining our operations and enhancing collaboration. I spearheaded the implementation of Jira Service Management, establishing an effective ticketing system that improved our internal communication and issue resolution processes. Additionally, I introduced GitHub Enterprise to optimize our software development and version control efforts. A significant achievement was ensuring that the new Waltham office was fully operational within 24 hours of our move, demonstrating my ability to coordinate complex tasks under tight deadlines. Furthermore, I implemented a centralized SQL server for lab instruments, which enhanced data management and accessibility across the team.",
      "duration": "Jul 2022 - Jun 2023",
      "location": "Waltham, MA",
      "logo": "./assets/ventus.png",
      "title": "IT Specialist",
      "tools": ["DattoRMM", "Jira Service Management", "linux", "SQL Server", "Windows"]
    },
    {
      "company": "Pillar Biosciences",
      "description": "In my role, I focus on enhancing collaboration and communication through the creation of Microsoft 365 Teams and the management of email distribution lists. I also provide support for conference room systems, ensuring smooth operation and troubleshooting any issues that arise. Additionally, I handle the onboarding and offboarding processes for users, facilitating a seamless transition for new and departing team members. My responsibilities further extend to troubleshooting network and VPN issues, utilizing the FortiGate portal to ensure a secure and reliable connectivity experience for all users.",
      "duration": "Feb 2022 - Jun 2022",
      "location": "Natick, MA",
      "logo": "./assets/pillar.png",
      "title": "Senior Desktop Support",
      "tools": ["FortiGate"]
    },
    {
      "company": "Jounce Therapeutics",
      "description": "In my role, I have been responsible for the creation of virtual machines (VMs) tailored to meet the specific needs of end-users and various business requirements. I have managed Box accounts, ensuring that permissions are appropriately set for the company’s folders to maintain security and accessibility. Additionally, I troubleshoot CyberArk SSO issues to facilitate seamless access for users. My proactive approach includes responding to alerts from Cortex XDR, which helps in identifying and mitigating potential threats swiftly. I also coordinate with vendors to ensure proper maintenance of IT lab equipment, ensuring optimal functionality. Furthermore, I troubleshoot network issues utilizing the Cisco Meraki portal, thus maintaining a robust and reliable network infrastructure.",
      "duration": "July 2021 – Feb 2022",
      "location": "Cambridge, MA",
      "logo": "./assets/jounce.jpg",
      "title": "Senior Desktop Support",
      "tools": ["Jira Service Management", "CyberArk", "Cortex XDR", "Cisco Meraki", "ManageEngine", "VMware"]
    },
    {
      "company": "Mass General Hospital",
      "description": "In my role within the Radiation Oncology department, I collaborated on developing a bug tracking web application utilizing various programming languages. I provided desk-side support for both the Radiology department at BWH and Radiation Oncology at MGH, ensuring seamless operations and user satisfaction. Additionally, I played an active role in the Windows 10 upgrade project for the Radiology departments at both institutions, facilitating a smooth transition for all users. Serving as a liaison between enterprise information systems and end-users, I effectively communicated needs and solutions to enhance overall departmental efficiency.",
      "duration": "May 2019 - Jul 2021",
      "location": "Boston, MA",
      "logo": "./assets/mgb.png",
      "title": "Senior Desktop Support",
      "tools": ["Angular","Github","javascript","PHP", "SmartDeploy","Citrix Workspace"]
    }
  ],
  "skills": [
    "Microsoft 365",
    "Microsoft Azure",
    "Jira Service Management",
    "ServiceNow",
    "Network Security",
    "Superior Customer Service",
    "Web Development",
    "Powershell Scripting",
    "Bilingual(English and Spanish)"
  ]
}
